export const sis = [
  { value: 'seoul', label: '서울' },
  { value: 'gyeonggi', label: '경기' },
  { value: 'incheon', label: '인천' },
  { value: 'busan', label: '부산' },
  { value: 'daegu', label: '대구' },
  { value: 'gyeongnam', label: '경남' },
  { value: 'daejeon', label: '대전' },
  { value: 'chungnam', label: '충남' },
  { value: 'gyeongbuk', label: '경북' },
  { value: 'gwangju', label: '광주' },
  { value: 'jeonbuk', label: '전북' },
  { value: 'chungbuk', label: '충북' },
  { value: 'gangwon', label: '강원' },
  { value: 'jeonnam', label: '전남' },
  { value: 'ulsan', label: '울산' },
  { value: 'jeju', label: '제주' },
  { value: 'sejong', label: '세종' },
];

export const seoul = [
  {
    si: '서울',
    gu: '종로구',
    code: 1111000000,
  },
  {
    si: '서울',
    gu: '중구',
    code: 1114000000,
  },
  {
    si: '서울',
    gu: '용산구',
    code: 1117000000,
  },
  {
    si: '서울',
    gu: '성동구',
    code: 1120000000,
  },
  {
    si: '서울',
    gu: '광진구',
    code: 1121500000,
  },
  {
    si: '서울',
    gu: '동대문구',
    code: 1123000000,
  },
  {
    si: '서울',
    gu: '중랑구',
    code: 1126000000,
  },
  {
    si: '서울',
    gu: '성북구',
    code: 1129000000,
  },
  {
    si: '서울',
    gu: '강북구',
    code: 1130500000,
  },
  {
    si: '서울',
    gu: '도봉구',
    code: 1132000000,
  },
  {
    si: '서울',
    gu: '노원구',
    code: 1135000000,
  },
  {
    si: '서울',
    gu: '은평구',
    code: 1138000000,
  },
  {
    si: '서울',
    gu: '서대문구',
    code: 1141000000,
  },
  {
    si: '서울',
    gu: '마포구',
    code: 1144000000,
  },
  {
    si: '서울',
    gu: '양천구',
    code: 1147000000,
  },
  {
    si: '서울',
    gu: '강서구',
    code: 1150000000,
  },
  {
    si: '서울',
    gu: '구로구',
    code: 1153000000,
  },
  {
    si: '서울',
    gu: '금천구',
    code: 1154500000,
  },
  {
    si: '서울',
    gu: '영등포구',
    code: 1156000000,
  },
  {
    si: '서울',
    gu: '동작구',
    code: 1159000000,
  },
  {
    si: '서울',
    gu: '관악구',
    code: 1162000000,
  },
  {
    si: '서울',
    gu: '서초구',
    code: 1165000000,
  },
  {
    si: '서울',
    gu: '강남구',
    code: 1168000000,
  },
  {
    si: '서울',
    gu: '송파구',
    code: 1171000000,
  },
  {
    si: '서울',
    gu: '강동구',
    code: 1174000000,
  },
];
export const gyeonggi = [
  {
    si: '경기',
    gu: '수원시 장안구',
    code: 4111100000,
  },
  {
    si: '경기',
    gu: '수원시 권선구',
    code: 4111300000,
  },
  {
    si: '경기',
    gu: '수원시 팔달구',
    code: 4111500000,
  },
  {
    si: '경기',
    gu: '수원시 영통구',
    code: 4111700000,
  },
  {
    si: '경기',
    gu: '성남시 수정구',
    code: 4113100000,
  },
  {
    si: '경기',
    gu: '성남시 중원구',
    code: 4113300000,
  },
  {
    si: '경기',
    gu: '성남시 분당구',
    code: 4113500000,
  },
  {
    si: '경기',
    gu: '의정부시',
    code: 4115000000,
  },
  {
    si: '경기',
    gu: '안양시 만안구',
    code: 4117100000,
  },
  {
    si: '경기',
    gu: '안양시 동안구',
    code: 4117300000,
  },
  {
    si: '경기',
    gu: '부천시 원미구',
    code: 4119200000,
  },
  {
    si: '경기',
    gu: '부천시 소사구',
    code: 4119400000,
  },
  {
    si: '경기',
    gu: '부천시 오정구',
    code: 4119600000,
  },
  {
    si: '경기',
    gu: '광명시',
    code: 4121000000,
  },
  {
    si: '경기',
    gu: '평택시',
    code: 4122000000,
  },
  {
    si: '경기',
    gu: '동두천시',
    code: 4125000000,
  },
  {
    si: '경기',
    gu: '안산시 상록구',
    code: 4127100000,
  },
  {
    si: '경기',
    gu: '안산시 단원구',
    code: 4127300000,
  },
  {
    si: '경기',
    gu: '고양시 덕양구',
    code: 4128100000,
  },
  {
    si: '경기',
    gu: '고양시 일산동구',
    code: 4128500000,
  },
  {
    si: '경기',
    gu: '고양시 일산서구',
    code: 4128700000,
  },
  {
    si: '경기',
    gu: '과천시',
    code: 4129000000,
  },
  {
    si: '경기',
    gu: '구리시',
    code: 4131000000,
  },
  {
    si: '경기',
    gu: '남양주시',
    code: 4136000000,
  },
  {
    si: '경기',
    gu: '오산시',
    code: 4137000000,
  },
  {
    si: '경기',
    gu: '시흥시',
    code: 4139000000,
  },
  {
    si: '경기',
    gu: '군포시',
    code: 4141000000,
  },
  {
    si: '경기',
    gu: '의왕시',
    code: 4143000000,
  },
  {
    si: '경기',
    gu: '하남시',
    code: 4145000000,
  },
  {
    si: '경기',
    gu: '용인시 처인구',
    code: 4146100000,
  },
  {
    si: '경기',
    gu: '용인시 기흥구',
    code: 4146300000,
  },
  {
    si: '경기',
    gu: '용인시 수지구',
    code: 4146500000,
  },
  {
    si: '경기',
    gu: '파주시',
    code: 4148000000,
  },
  {
    si: '경기',
    gu: '이천시',
    code: 4150000000,
  },
  {
    si: '경기',
    gu: '안성시',
    code: 4155000000,
  },
  {
    si: '경기',
    gu: '김포시',
    code: 4157000000,
  },
  {
    si: '경기',
    gu: '화성시',
    code: 4159000000,
  },
  {
    si: '경기',
    gu: '광주시',
    code: 4161000000,
  },
  {
    si: '경기',
    gu: '양주시',
    code: 4163000000,
  },
  {
    si: '경기',
    gu: '포천시',
    code: 4165000000,
  },
  {
    si: '경기',
    gu: '여주시',
    code: 4167000000,
  },
  {
    si: '경기',
    gu: '연천군',
    code: 4180000000,
  },
  {
    si: '경기',
    gu: '가평군',
    code: 4182000000,
  },
  {
    si: '경기',
    gu: '양평군',
    code: 4183000000,
  },
];

export const incheon = [
  {
    si: '인천',
    gu: '중구',
    code: 2811000000,
  },
  {
    si: '인천',
    gu: '동구',
    code: 2814000000,
  },
  {
    si: '인천',
    gu: '미추홀구',
    code: 2817700000,
  },
  {
    si: '인천',
    gu: '연수구',
    code: 2818500000,
  },
  {
    si: '인천',
    gu: '남동구',
    code: 2820000000,
  },
  {
    si: '인천',
    gu: '부평구',
    code: 2823700000,
  },
  {
    si: '인천',
    gu: '계양구',
    code: 2824500000,
  },
  {
    si: '인천',
    gu: '서구',
    code: 2826000000,
  },
  {
    si: '인천',
    gu: '강화군',
    code: 2871000000,
  },
  {
    si: '인천',
    gu: '옹진군',
    code: 2872000000,
  },
];

export const daejeon = [
  {
    si: '대전',
    gu: '동구',
    code: 3011000000,
  },
  {
    si: '대전',
    gu: '중구',
    code: 3014000000,
  },
  {
    si: '대전',
    gu: '서구',
    code: 3017000000,
  },
  {
    si: '대전',
    gu: '유성구',
    code: 3020000000,
  },
  {
    si: '대전',
    gu: '대덕구',
    code: 3023000000,
  },
];

export const daegu = [
  {
    si: '대구',
    gu: '중구',
    code: 2711000000,
  },
  {
    si: '대구',
    gu: '동구',
    code: 2714000000,
  },
  {
    si: '대구',
    gu: '서구',
    code: 2717000000,
  },
  {
    si: '대구',
    gu: '남구',
    code: 2720000000,
  },
  {
    si: '대구',
    gu: '북구',
    code: 2723000000,
  },
  {
    si: '대구',
    gu: '수성구',
    code: 2726000000,
  },
  {
    si: '대구',
    gu: '달서구',
    code: 2729000000,
  },
  {
    si: '대구',
    gu: '달성군',
    code: 2771000000,
  },
  {
    si: '대구',
    gu: '군위군',
    code: 2772000000,
  },
];

export const busan = [
  {
    si: '부산',
    gu: '중구',
    code: 2611000000,
  },
  {
    si: '부산',
    gu: '서구',
    code: 2614000000,
  },
  {
    si: '부산',
    gu: '동구',
    code: 2617000000,
  },
  {
    si: '부산',
    gu: '영도구',
    code: 2620000000,
  },
  {
    si: '부산',
    gu: '부산진구',
    code: 2623000000,
  },
  {
    si: '부산',
    gu: '동래구',
    code: 2626000000,
  },
  {
    si: '부산',
    gu: '남구',
    code: 2629000000,
  },
  {
    si: '부산',
    gu: '북구',
    code: 2632000000,
  },
  {
    si: '부산',
    gu: '해운대구',
    code: 2635000000,
  },
  {
    si: '부산',
    gu: '사하구',
    code: 2638000000,
  },
  {
    si: '부산',
    gu: '금정구',
    code: 2641000000,
  },
  {
    si: '부산',
    gu: '강서구',
    code: 2644000000,
  },
  {
    si: '부산',
    gu: '연제구',
    code: 2647000000,
  },
  {
    si: '부산',
    gu: '수영구',
    code: 2650000000,
  },
  {
    si: '부산',
    gu: '사상구',
    code: 2653000000,
  },
  {
    si: '부산',
    gu: '기장군',
    code: 2671000000,
  },
];

export const gwangju = [
  {
    si: '광주',
    gu: '동구',
    code: 2911000000,
  },
  {
    si: '광주',
    gu: '서구',
    code: 2914000000,
  },
  {
    si: '광주',
    gu: '남구',
    code: 2915500000,
  },
  {
    si: '광주',
    gu: '북구',
    code: 2917000000,
  },
  {
    si: '광주',
    gu: '광산구',
    code: 2920000000,
  },
];

export const ulsan = [
  {
    si: '울산',
    gu: '중구',
    code: 3111000000,
  },
  {
    si: '울산',
    gu: '남구',
    code: 3114000000,
  },
  {
    si: '울산',
    gu: '동구',
    code: 3117000000,
  },
  {
    si: '울산',
    gu: '북구',
    code: 3120000000,
  },
  {
    si: '울산',
    gu: '울주군',
    code: 3171000000,
  },
];

export const sejong = [
  {
    si: '세종',
    gu: '세종특별자치시',
    code: 3611000000,
  },
];
export const gangwon = [
  {
    si: '강원',
    gu: '춘천시',
    code: 5111000000,
  },
  {
    si: '강원',
    gu: '원주시',
    code: 5113000000,
  },
  {
    si: '강원',
    gu: '강릉시',
    code: 5115000000,
  },
  {
    si: '강원',
    gu: '동해시',
    code: 5117000000,
  },
  {
    si: '강원',
    gu: '태백시',
    code: 5119000000,
  },
  {
    si: '강원',
    gu: '속초시',
    code: 5121000000,
  },
  {
    si: '강원',
    gu: '삼척시',
    code: 5123000000,
  },
  {
    si: '강원',
    gu: '홍천군',
    code: 5172000000,
  },
  {
    si: '강원',
    gu: '횡성군',
    code: 5173000000,
  },
  {
    si: '강원',
    gu: '영월군',
    code: 5175000000,
  },
  {
    si: '강원',
    gu: '평창군',
    code: 5176000000,
  },
  {
    si: '강원',
    gu: '정선군',
    code: 5177000000,
  },
  {
    si: '강원',
    gu: '철원군',
    code: 5178000000,
  },
  {
    si: '강원',
    gu: '화천군',
    code: 5179000000,
  },
  {
    si: '강원',
    gu: '양구군',
    code: 5180000000,
  },
  {
    si: '강원',
    gu: '인제군',
    code: 5181000000,
  },
  {
    si: '강원',
    gu: '고성군',
    code: 5182000000,
  },
  {
    si: '강원',
    gu: '양양군',
    code: 5183000000,
  },
];
export const chungbuk = [
  {
    si: '충북',
    gu: '청주시 상당구',
    code: 4311100000,
  },
  {
    si: '충북',
    gu: '청주시 서원구',
    code: 4311200000,
  },
  {
    si: '충북',
    gu: '청주시 흥덕구',
    code: 4311300000,
  },
  {
    si: '충북',
    gu: '청주시 청원구',
    code: 4311400000,
  },
  {
    si: '충북',
    gu: '충주시',
    code: 4313000000,
  },
  {
    si: '충북',
    gu: '제천시',
    code: 4315000000,
  },
  {
    si: '충북',
    gu: '보은군',
    code: 4372000000,
  },
  {
    si: '충북',
    gu: '옥천군',
    code: 4373000000,
  },
  {
    si: '충북',
    gu: '영동군',
    code: 4374000000,
  },
  {
    si: '충북',
    gu: '증평군',
    code: 4374500000,
  },
  {
    si: '충북',
    gu: '진천군',
    code: 4375000000,
  },
  {
    si: '충북',
    gu: '괴산군',
    code: 4376000000,
  },
  {
    si: '충북',
    gu: '음성군',
    code: 4377000000,
  },
  {
    si: '충북',
    gu: '단양군',
    code: 4380000000,
  },
];

export const chungnam = [
  {
    si: '충남',
    gu: '천안시 동남구',
    code: 4413100000,
  },
  {
    si: '충남',
    gu: '천안시 서북구',
    code: 4413300000,
  },
  {
    si: '충남',
    gu: '공주시',
    code: 4415000000,
  },
  {
    si: '충남',
    gu: '보령시',
    code: 4418000000,
  },
  {
    si: '충남',
    gu: '아산시',
    code: 4420000000,
  },
  {
    si: '충남',
    gu: '서산시',
    code: 4421000000,
  },
  {
    si: '충남',
    gu: '논산시',
    code: 4423000000,
  },
  {
    si: '충남',
    gu: '계룡시',
    code: 4425000000,
  },
  {
    si: '충남',
    gu: '당진시',
    code: 4427000000,
  },
  {
    si: '충남',
    gu: '금산군',
    code: 4471000000,
  },
  {
    si: '충남',
    gu: '부여군',
    code: 4476000000,
  },
  {
    si: '충남',
    gu: '서천군',
    code: 4477000000,
  },
  {
    si: '충남',
    gu: '청양군',
    code: 4479000000,
  },
  {
    si: '충남',
    gu: '홍성군',
    code: 4480000000,
  },
  {
    si: '충남',
    gu: '예산군',
    code: 4481000000,
  },
  {
    si: '충남',
    gu: '태안군',
    code: 4482500000,
  },
];

export const jeonbuk = [
  {
    si: '전북',
    gu: '전주시 완산구',
    code: 5211100000,
  },
  {
    si: '전북',
    gu: '전주시 덕진구',
    code: 5211300000,
  },
  {
    si: '전북',
    gu: '군산시',
    code: 5213000000,
  },
  {
    si: '전북',
    gu: '익산시',
    code: 5214000000,
  },
  {
    si: '전북',
    gu: '정읍시',
    code: 5218000000,
  },
  {
    si: '전북',
    gu: '남원시',
    code: 5219000000,
  },
  {
    si: '전북',
    gu: '김제시',
    code: 5221000000,
  },
  {
    si: '전북',
    gu: '완주군',
    code: 5271000000,
  },
  {
    si: '전북',
    gu: '진안군',
    code: 5272000000,
  },
  {
    si: '전북',
    gu: '무주군',
    code: 5273000000,
  },
  {
    si: '전북',
    gu: '장수군',
    code: 5274000000,
  },
  {
    si: '전북',
    gu: '임실군',
    code: 5275000000,
  },
  {
    si: '전북',
    gu: '순창군',
    code: 5277000000,
  },
  {
    si: '전북',
    gu: '고창군',
    code: 5279000000,
  },
  {
    si: '전북',
    gu: '부안군',
    code: 5280000000,
  },
];

export const jeonnam = [
  {
    si: '전남',
    gu: '목포시',
    code: 4611000000,
  },
  {
    si: '전남',
    gu: '여수시',
    code: 4613000000,
  },
  {
    si: '전남',
    gu: '순천시',
    code: 4615000000,
  },
  {
    si: '전남',
    gu: '나주시',
    code: 4617000000,
  },
  {
    si: '전남',
    gu: '광양시',
    code: 4623000000,
  },
  {
    si: '전남',
    gu: '담양군',
    code: 4671000000,
  },
  {
    si: '전남',
    gu: '곡성군',
    code: 4672000000,
  },
  {
    si: '전남',
    gu: '구례군',
    code: 4673000000,
  },
  {
    si: '전남',
    gu: '고흥군',
    code: 4677000000,
  },
  {
    si: '전남',
    gu: '보성군',
    code: 4678000000,
  },
  {
    si: '전남',
    gu: '화순군',
    code: 4679000000,
  },
  {
    si: '전남',
    gu: '장흥군',
    code: 4680000000,
  },
  {
    si: '전남',
    gu: '강진군',
    code: 4681000000,
  },
  {
    si: '전남',
    gu: '해남군',
    code: 4682000000,
  },
  {
    si: '전남',
    gu: '영암군',
    code: 4683000000,
  },
  {
    si: '전남',
    gu: '무안군',
    code: 4684000000,
  },
  {
    si: '전남',
    gu: '함평군',
    code: 4686000000,
  },
  {
    si: '전남',
    gu: '영광군',
    code: 4687000000,
  },
  {
    si: '전남',
    gu: '장성군',
    code: 4688000000,
  },
  {
    si: '전남',
    gu: '완도군',
    code: 4689000000,
  },
  {
    si: '전남',
    gu: '진도군',
    code: 4690000000,
  },
  {
    si: '전남',
    gu: '신안군',
    code: 4691000000,
  },
];
export const gyeongbuk = [
  {
    si: '경북',
    gu: '포항시 남구',
    code: 4711100000,
  },
  {
    si: '경북',
    gu: '포항시 북구',
    code: 4711300000,
  },
  {
    si: '경북',
    gu: '경주시',
    code: 4713000000,
  },
  {
    si: '경북',
    gu: '김천시',
    code: 4715000000,
  },
  {
    si: '경북',
    gu: '안동시',
    code: 4717000000,
  },
  {
    si: '경북',
    gu: '구미시',
    code: 4719000000,
  },
  {
    si: '경북',
    gu: '영주시',
    code: 4721000000,
  },
  {
    si: '경북',
    gu: '영천시',
    code: 4723000000,
  },
  {
    si: '경북',
    gu: '상주시',
    code: 4725000000,
  },
  {
    si: '경북',
    gu: '문경시',
    code: 4728000000,
  },
  {
    si: '경북',
    gu: '경산시',
    code: 4729000000,
  },
  {
    si: '경북',
    gu: '의성군',
    code: 4773000000,
  },
  {
    si: '경북',
    gu: '청송군',
    code: 4775000000,
  },
  {
    si: '경북',
    gu: '영양군',
    code: 4776000000,
  },
  {
    si: '경북',
    gu: '영덕군',
    code: 4777000000,
  },
  {
    si: '경북',
    gu: '청도군',
    code: 4782000000,
  },
  {
    si: '경북',
    gu: '고령군',
    code: 4783000000,
  },
  {
    si: '경북',
    gu: '성주군',
    code: 4784000000,
  },
  {
    si: '경북',
    gu: '칠곡군',
    code: 4785000000,
  },
  {
    si: '경북',
    gu: '예천군',
    code: 4790000000,
  },
  {
    si: '경북',
    gu: '봉화군',
    code: 4792000000,
  },
  {
    si: '경북',
    gu: '울진군',
    code: 4793000000,
  },
  {
    si: '경북',
    gu: '울릉군',
    code: 4794000000,
  },
];
export const gyeongnam = [
  {
    si: '경남',
    gu: '창원시 의창구',
    code: 4812100000,
  },
  {
    si: '경남',
    gu: '창원시 성산구',
    code: 4812300000,
  },
  {
    si: '경남',
    gu: '창원시 마산합포구',
    code: 4812500000,
  },
  {
    si: '경남',
    gu: '창원시 마산회원구',
    code: 4812700000,
  },
  {
    si: '경남',
    gu: '창원시 진해구',
    code: 4812900000,
  },
  {
    si: '경남',
    gu: '진주시',
    code: 4817000000,
  },
  {
    si: '경남',
    gu: '통영시',
    code: 4822000000,
  },
  {
    si: '경남',
    gu: '사천시',
    code: 4824000000,
  },
  {
    si: '경남',
    gu: '김해시',
    code: 4825000000,
  },
  {
    si: '경남',
    gu: '밀양시',
    code: 4827000000,
  },
  {
    si: '경남',
    gu: '거제시',
    code: 4831000000,
  },
  {
    si: '경남',
    gu: '양산시',
    code: 4833000000,
  },
  {
    si: '경남',
    gu: '의령군',
    code: 4872000000,
  },
  {
    si: '경남',
    gu: '함안군',
    code: 4873000000,
  },
  {
    si: '경남',
    gu: '창녕군',
    code: 4874000000,
  },
  {
    si: '경남',
    gu: '고성군',
    code: 4882000000,
  },
  {
    si: '경남',
    gu: '남해군',
    code: 4884000000,
  },
  {
    si: '경남',
    gu: '하동군',
    code: 4885000000,
  },
  {
    si: '경남',
    gu: '산청군',
    code: 4886000000,
  },
  {
    si: '경남',
    gu: '함양군',
    code: 4887000000,
  },
  {
    si: '경남',
    gu: '거창군',
    code: 4888000000,
  },
  {
    si: '경남',
    gu: '합천군',
    code: 4889000000,
  },
];

export const jeju = [
  {
    si: '제주',
    gu: '제주시',
    code: 5011000000,
  },
  {
    si: '제주',
    gu: '서귀포시',
    code: 5013000000,
  },
];

export const sigus = {
  seoul,
  gyeonggi,
  incheon,
  daejeon,
  daegu,
  busan,
  gwangju,
  ulsan,
  sejong,
  gangwon,
  chungbuk,
  chungnam,
  jeonbuk,
  jeonnam,
  gyeongbuk,
  gyeongnam,
  jeju,
};

const all = [
  ...seoul,
  ...gyeonggi,
  ...incheon,
  ...daejeon,
  ...daegu,
  ...busan,
  ...gwangju,
  ...ulsan,
  ...sejong,
  ...gangwon,
  ...chungbuk,
  ...chungnam,
  ...jeonbuk,
  ...jeonnam,
  ...gyeongbuk,
  ...gyeongnam,
  ...jeju,
];

export const map = new Map();

all.forEach(item => {
  map.set(item.code, item);
});
